Using TensorFlow backend.
2017-10-24 14:34:26.634422: W tensorflow/core/platform/cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use SSE4.2 instructions, but these are available on your machine and could speed up CPU computations.
2017-10-24 14:34:26.634448: W tensorflow/core/platform/cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX instructions, but these are available on your machine and could speed up CPU computations.
2017-10-24 14:34:26.634453: W tensorflow/core/platform/cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use AVX2 instructions, but these are available on your machine and could speed up CPU computations.
2017-10-24 14:34:26.634471: W tensorflow/core/platform/cpu_feature_guard.cc:45] The TensorFlow library wasn't compiled to use FMA instructions, but these are available on your machine and could speed up CPU computations.
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 100, 100, 3)   0                                            
____________________________________________________________________________________________________
block1_conv1 (Convolution2D)     (None, 49, 49, 32)    864         input_1[0][0]                    
____________________________________________________________________________________________________
block1_conv1_bn (BatchNormalizat (None, 49, 49, 32)    128         block1_conv1[0][0]               
____________________________________________________________________________________________________
block1_conv1_act (Activation)    (None, 49, 49, 32)    0           block1_conv1_bn[0][0]            
____________________________________________________________________________________________________
block1_conv2 (Convolution2D)     (None, 47, 47, 64)    18432       block1_conv1_act[0][0]           
____________________________________________________________________________________________________
block1_conv2_bn (BatchNormalizat (None, 47, 47, 64)    256         block1_conv2[0][0]               
____________________________________________________________________________________________________
block1_conv2_act (Activation)    (None, 47, 47, 64)    0           block1_conv2_bn[0][0]            
____________________________________________________________________________________________________
block2_sepconv1 (SeparableConvol (None, 47, 47, 128)   8768        block1_conv2_act[0][0]           
____________________________________________________________________________________________________
block2_sepconv1_bn (BatchNormali (None, 47, 47, 128)   512         block2_sepconv1[0][0]            
____________________________________________________________________________________________________
block2_sepconv2_act (Activation) (None, 47, 47, 128)   0           block2_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block2_sepconv2 (SeparableConvol (None, 47, 47, 128)   17536       block2_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block2_sepconv2_bn (BatchNormali (None, 47, 47, 128)   512         block2_sepconv2[0][0]            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 24, 24, 128)   8192        block1_conv2_act[0][0]           
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, 24, 24, 128)   0           block2_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 24, 24, 128)   512         convolution2d_1[0][0]            
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 24, 24, 128)   0           block2_pool[0][0]                
                                                                   batchnormalization_1[0][0]       
____________________________________________________________________________________________________
block3_sepconv1_act (Activation) (None, 24, 24, 128)   0           merge_1[0][0]                    
____________________________________________________________________________________________________
block3_sepconv1 (SeparableConvol (None, 24, 24, 256)   33920       block3_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block3_sepconv1_bn (BatchNormali (None, 24, 24, 256)   1024        block3_sepconv1[0][0]            
____________________________________________________________________________________________________
block3_sepconv2_act (Activation) (None, 24, 24, 256)   0           block3_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block3_sepconv2 (SeparableConvol (None, 24, 24, 256)   67840       block3_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block3_sepconv2_bn (BatchNormali (None, 24, 24, 256)   1024        block3_sepconv2[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 12, 12, 256)   32768       merge_1[0][0]                    
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, 12, 12, 256)   0           block3_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 12, 12, 256)   1024        convolution2d_2[0][0]            
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 12, 12, 256)   0           block3_pool[0][0]                
                                                                   batchnormalization_2[0][0]       
____________________________________________________________________________________________________
block4_sepconv1_act (Activation) (None, 12, 12, 256)   0           merge_2[0][0]                    
____________________________________________________________________________________________________
block4_sepconv1 (SeparableConvol (None, 12, 12, 728)   188672      block4_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block4_sepconv1_bn (BatchNormali (None, 12, 12, 728)   2912        block4_sepconv1[0][0]            
____________________________________________________________________________________________________
block4_sepconv2_act (Activation) (None, 12, 12, 728)   0           block4_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block4_sepconv2 (SeparableConvol (None, 12, 12, 728)   536536      block4_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block4_sepconv2_bn (BatchNormali (None, 12, 12, 728)   2912        block4_sepconv2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 6, 6, 728)     186368      merge_2[0][0]                    
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, 6, 6, 728)     0           block4_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 6, 6, 728)     2912        convolution2d_3[0][0]            
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 6, 6, 728)     0           block4_pool[0][0]                
                                                                   batchnormalization_3[0][0]       
____________________________________________________________________________________________________
block5_sepconv1_act (Activation) (None, 6, 6, 728)     0           merge_3[0][0]                    
____________________________________________________________________________________________________
block5_sepconv1 (SeparableConvol (None, 6, 6, 728)     536536      block5_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block5_sepconv1_bn (BatchNormali (None, 6, 6, 728)     2912        block5_sepconv1[0][0]            
____________________________________________________________________________________________________
block5_sepconv2_act (Activation) (None, 6, 6, 728)     0           block5_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block5_sepconv2 (SeparableConvol (None, 6, 6, 728)     536536      block5_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block5_sepconv2_bn (BatchNormali (None, 6, 6, 728)     2912        block5_sepconv2[0][0]            
____________________________________________________________________________________________________
block5_sepconv3_act (Activation) (None, 6, 6, 728)     0           block5_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
block5_sepconv3 (SeparableConvol (None, 6, 6, 728)     536536      block5_sepconv3_act[0][0]        
____________________________________________________________________________________________________
block5_sepconv3_bn (BatchNormali (None, 6, 6, 728)     2912        block5_sepconv3[0][0]            
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 6, 6, 728)     0           block5_sepconv3_bn[0][0]         
                                                                   merge_3[0][0]                    
____________________________________________________________________________________________________
block6_sepconv1_act (Activation) (None, 6, 6, 728)     0           merge_4[0][0]                    
____________________________________________________________________________________________________
block6_sepconv1 (SeparableConvol (None, 6, 6, 728)     536536      block6_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block6_sepconv1_bn (BatchNormali (None, 6, 6, 728)     2912        block6_sepconv1[0][0]            
____________________________________________________________________________________________________
block6_sepconv2_act (Activation) (None, 6, 6, 728)     0           block6_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block6_sepconv2 (SeparableConvol (None, 6, 6, 728)     536536      block6_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block6_sepconv2_bn (BatchNormali (None, 6, 6, 728)     2912        block6_sepconv2[0][0]            
____________________________________________________________________________________________________
block6_sepconv3_act (Activation) (None, 6, 6, 728)     0           block6_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
block6_sepconv3 (SeparableConvol (None, 6, 6, 728)     536536      block6_sepconv3_act[0][0]        
____________________________________________________________________________________________________
block6_sepconv3_bn (BatchNormali (None, 6, 6, 728)     2912        block6_sepconv3[0][0]            
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 6, 6, 728)     0           block6_sepconv3_bn[0][0]         
                                                                   merge_4[0][0]                    
____________________________________________________________________________________________________
block7_sepconv1_act (Activation) (None, 6, 6, 728)     0           merge_5[0][0]                    
____________________________________________________________________________________________________
block7_sepconv1 (SeparableConvol (None, 6, 6, 728)     536536      block7_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block7_sepconv1_bn (BatchNormali (None, 6, 6, 728)     2912        block7_sepconv1[0][0]            
____________________________________________________________________________________________________
block7_sepconv2_act (Activation) (None, 6, 6, 728)     0           block7_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block7_sepconv2 (SeparableConvol (None, 6, 6, 728)     536536      block7_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block7_sepconv2_bn (BatchNormali (None, 6, 6, 728)     2912        block7_sepconv2[0][0]            
____________________________________________________________________________________________________
block7_sepconv3_act (Activation) (None, 6, 6, 728)     0           block7_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
block7_sepconv3 (SeparableConvol (None, 6, 6, 728)     536536      block7_sepconv3_act[0][0]        
____________________________________________________________________________________________________
block7_sepconv3_bn (BatchNormali (None, 6, 6, 728)     2912        block7_sepconv3[0][0]            
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 6, 6, 728)     0           block7_sepconv3_bn[0][0]         
                                                                   merge_5[0][0]                    
____________________________________________________________________________________________________
block8_sepconv1_act (Activation) (None, 6, 6, 728)     0           merge_6[0][0]                    
____________________________________________________________________________________________________
block8_sepconv1 (SeparableConvol (None, 6, 6, 728)     536536      block8_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block8_sepconv1_bn (BatchNormali (None, 6, 6, 728)     2912        block8_sepconv1[0][0]            
____________________________________________________________________________________________________
block8_sepconv2_act (Activation) (None, 6, 6, 728)     0           block8_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block8_sepconv2 (SeparableConvol (None, 6, 6, 728)     536536      block8_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block8_sepconv2_bn (BatchNormali (None, 6, 6, 728)     2912        block8_sepconv2[0][0]            
____________________________________________________________________________________________________
block8_sepconv3_act (Activation) (None, 6, 6, 728)     0           block8_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
block8_sepconv3 (SeparableConvol (None, 6, 6, 728)     536536      block8_sepconv3_act[0][0]        
____________________________________________________________________________________________________
block8_sepconv3_bn (BatchNormali (None, 6, 6, 728)     2912        block8_sepconv3[0][0]            
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 6, 6, 728)     0           block8_sepconv3_bn[0][0]         
                                                                   merge_6[0][0]                    
____________________________________________________________________________________________________
block9_sepconv1_act (Activation) (None, 6, 6, 728)     0           merge_7[0][0]                    
____________________________________________________________________________________________________
block9_sepconv1 (SeparableConvol (None, 6, 6, 728)     536536      block9_sepconv1_act[0][0]        
____________________________________________________________________________________________________
block9_sepconv1_bn (BatchNormali (None, 6, 6, 728)     2912        block9_sepconv1[0][0]            
____________________________________________________________________________________________________
block9_sepconv2_act (Activation) (None, 6, 6, 728)     0           block9_sepconv1_bn[0][0]         
____________________________________________________________________________________________________
block9_sepconv2 (SeparableConvol (None, 6, 6, 728)     536536      block9_sepconv2_act[0][0]        
____________________________________________________________________________________________________
block9_sepconv2_bn (BatchNormali (None, 6, 6, 728)     2912        block9_sepconv2[0][0]            
____________________________________________________________________________________________________
block9_sepconv3_act (Activation) (None, 6, 6, 728)     0           block9_sepconv2_bn[0][0]         
____________________________________________________________________________________________________
block9_sepconv3 (SeparableConvol (None, 6, 6, 728)     536536      block9_sepconv3_act[0][0]        
____________________________________________________________________________________________________
block9_sepconv3_bn (BatchNormali (None, 6, 6, 728)     2912        block9_sepconv3[0][0]            
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 6, 6, 728)     0           block9_sepconv3_bn[0][0]         
                                                                   merge_7[0][0]                    
____________________________________________________________________________________________________
block10_sepconv1_act (Activation (None, 6, 6, 728)     0           merge_8[0][0]                    
____________________________________________________________________________________________________
block10_sepconv1 (SeparableConvo (None, 6, 6, 728)     536536      block10_sepconv1_act[0][0]       
____________________________________________________________________________________________________
block10_sepconv1_bn (BatchNormal (None, 6, 6, 728)     2912        block10_sepconv1[0][0]           
____________________________________________________________________________________________________
block10_sepconv2_act (Activation (None, 6, 6, 728)     0           block10_sepconv1_bn[0][0]        
____________________________________________________________________________________________________
block10_sepconv2 (SeparableConvo (None, 6, 6, 728)     536536      block10_sepconv2_act[0][0]       
____________________________________________________________________________________________________
block10_sepconv2_bn (BatchNormal (None, 6, 6, 728)     2912        block10_sepconv2[0][0]           
____________________________________________________________________________________________________
block10_sepconv3_act (Activation (None, 6, 6, 728)     0           block10_sepconv2_bn[0][0]        
____________________________________________________________________________________________________
block10_sepconv3 (SeparableConvo (None, 6, 6, 728)     536536      block10_sepconv3_act[0][0]       
____________________________________________________________________________________________________
block10_sepconv3_bn (BatchNormal (None, 6, 6, 728)     2912        block10_sepconv3[0][0]           
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 6, 6, 728)     0           block10_sepconv3_bn[0][0]        
                                                                   merge_8[0][0]                    
____________________________________________________________________________________________________
block11_sepconv1_act (Activation (None, 6, 6, 728)     0           merge_9[0][0]                    
____________________________________________________________________________________________________
block11_sepconv1 (SeparableConvo (None, 6, 6, 728)     536536      block11_sepconv1_act[0][0]       
____________________________________________________________________________________________________
block11_sepconv1_bn (BatchNormal (None, 6, 6, 728)     2912        block11_sepconv1[0][0]           
____________________________________________________________________________________________________
block11_sepconv2_act (Activation (None, 6, 6, 728)     0           block11_sepconv1_bn[0][0]        
____________________________________________________________________________________________________
block11_sepconv2 (SeparableConvo (None, 6, 6, 728)     536536      block11_sepconv2_act[0][0]       
____________________________________________________________________________________________________
block11_sepconv2_bn (BatchNormal (None, 6, 6, 728)     2912        block11_sepconv2[0][0]           
____________________________________________________________________________________________________
block11_sepconv3_act (Activation (None, 6, 6, 728)     0           block11_sepconv2_bn[0][0]        
____________________________________________________________________________________________________
block11_sepconv3 (SeparableConvo (None, 6, 6, 728)     536536      block11_sepconv3_act[0][0]       
____________________________________________________________________________________________________
block11_sepconv3_bn (BatchNormal (None, 6, 6, 728)     2912        block11_sepconv3[0][0]           
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 6, 6, 728)     0           block11_sepconv3_bn[0][0]        
                                                                   merge_9[0][0]                    
____________________________________________________________________________________________________
block12_sepconv1_act (Activation (None, 6, 6, 728)     0           merge_10[0][0]                   
____________________________________________________________________________________________________
block12_sepconv1 (SeparableConvo (None, 6, 6, 728)     536536      block12_sepconv1_act[0][0]       
____________________________________________________________________________________________________
block12_sepconv1_bn (BatchNormal (None, 6, 6, 728)     2912        block12_sepconv1[0][0]           
____________________________________________________________________________________________________
block12_sepconv2_act (Activation (None, 6, 6, 728)     0           block12_sepconv1_bn[0][0]        
____________________________________________________________________________________________________
block12_sepconv2 (SeparableConvo (None, 6, 6, 728)     536536      block12_sepconv2_act[0][0]       
____________________________________________________________________________________________________
block12_sepconv2_bn (BatchNormal (None, 6, 6, 728)     2912        block12_sepconv2[0][0]           
____________________________________________________________________________________________________
block12_sepconv3_act (Activation (None, 6, 6, 728)     0           block12_sepconv2_bn[0][0]        
____________________________________________________________________________________________________
block12_sepconv3 (SeparableConvo (None, 6, 6, 728)     536536      block12_sepconv3_act[0][0]       
____________________________________________________________________________________________________
block12_sepconv3_bn (BatchNormal (None, 6, 6, 728)     2912        block12_sepconv3[0][0]           
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 6, 6, 728)     0           block12_sepconv3_bn[0][0]        
                                                                   merge_10[0][0]                   
____________________________________________________________________________________________________
block13_sepconv1_act (Activation (None, 6, 6, 728)     0           merge_11[0][0]                   
____________________________________________________________________________________________________
block13_sepconv1 (SeparableConvo (None, 6, 6, 728)     536536      block13_sepconv1_act[0][0]       
____________________________________________________________________________________________________
block13_sepconv1_bn (BatchNormal (None, 6, 6, 728)     2912        block13_sepconv1[0][0]           
____________________________________________________________________________________________________
block13_sepconv2_act (Activation (None, 6, 6, 728)     0           block13_sepconv1_bn[0][0]        
____________________________________________________________________________________________________
block13_sepconv2 (SeparableConvo (None, 6, 6, 1024)    752024      block13_sepconv2_act[0][0]       
____________________________________________________________________________________________________
block13_sepconv2_bn (BatchNormal (None, 6, 6, 1024)    4096        block13_sepconv2[0][0]           
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 3, 3, 1024)    745472      merge_11[0][0]                   
____________________________________________________________________________________________________
block13_pool (MaxPooling2D)      (None, 3, 3, 1024)    0           block13_sepconv2_bn[0][0]        
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 3, 3, 1024)    4096        convolution2d_4[0][0]            
____________________________________________________________________________________________________
merge_12 (Merge)                 (None, 3, 3, 1024)    0           block13_pool[0][0]               
                                                                   batchnormalization_4[0][0]       
____________________________________________________________________________________________________
block14_sepconv1 (SeparableConvo (None, 3, 3, 1536)    1582080     merge_12[0][0]                   
____________________________________________________________________________________________________
block14_sepconv1_bn (BatchNormal (None, 3, 3, 1536)    6144        block14_sepconv1[0][0]           
____________________________________________________________________________________________________
block14_sepconv1_act (Activation (None, 3, 3, 1536)    0           block14_sepconv1_bn[0][0]        
____________________________________________________________________________________________________
block14_sepconv2 (SeparableConvo (None, 3, 3, 2048)    3159552     block14_sepconv1_act[0][0]       
____________________________________________________________________________________________________
block14_sepconv2_bn (BatchNormal (None, 3, 3, 2048)    8192        block14_sepconv2[0][0]           
____________________________________________________________________________________________________
block14_sepconv2_act (Activation (None, 3, 3, 2048)    0           block14_sepconv2_bn[0][0]        
____________________________________________________________________________________________________
globalaveragepooling2d_1 (Global (None, 2048)          0           block14_sepconv2_act[0][0]       
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 10)            20490       globalaveragepooling2d_1[0][0]   
====================================================================================================
Total params: 20,881,970
Trainable params: 20,827,442
Non-trainable params: 54,528
____________________________________________________________________________________________________
None
Found 103287 images belonging to 10 classes.
Found 25879 images belonging to 10 classes.
Epoch 1/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.4859 - acc: 0.4732Epoch 00000: val_acc improved from -inf to 0.54925, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 6994s - loss: 1.4859 - acc: 0.4732 - val_loss: 1.2391 - val_acc: 0.5492
Epoch 2/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.3495 - acc: 0.5120Epoch 00001: val_acc improved from 0.54925 to 0.57444, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 6959s - loss: 1.3495 - acc: 0.5120 - val_loss: 1.1878 - val_acc: 0.5744
Epoch 3/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.3200 - acc: 0.5224Epoch 00002: val_acc improved from 0.57444 to 0.57688, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 6998s - loss: 1.3199 - acc: 0.5225 - val_loss: 1.1783 - val_acc: 0.5769
Epoch 4/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.3082 - acc: 0.5307Epoch 00003: val_acc improved from 0.57688 to 0.59477, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 6994s - loss: 1.3081 - acc: 0.5307 - val_loss: 1.1349 - val_acc: 0.5948
Epoch 5/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.3004 - acc: 0.5321Epoch 00004: val_acc improved from 0.59477 to 0.59937, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 6994s - loss: 1.3004 - acc: 0.5321 - val_loss: 1.1171 - val_acc: 0.5994
Epoch 6/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.2934 - acc: 0.5339Epoch 00005: val_acc did not improve
103287/103287 [==============================] - 7021s - loss: 1.2934 - acc: 0.5339 - val_loss: 1.1395 - val_acc: 0.5906
Epoch 7/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.2954 - acc: 0.5335Epoch 00006: val_acc did not improve
103287/103287 [==============================] - 7029s - loss: 1.2955 - acc: 0.5334 - val_loss: 1.1574 - val_acc: 0.5895
Epoch 8/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.2914 - acc: 0.5359Epoch 00007: val_acc improved from 0.59937 to 0.60134, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/top_model_weights.h5
103287/103287 [==============================] - 7053s - loss: 1.2914 - acc: 0.5358 - val_loss: 1.1182 - val_acc: 0.6013
Epoch 9/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.2909 - acc: 0.5343Epoch 00008: val_acc did not improve
103287/103287 [==============================] - 7020s - loss: 1.2910 - acc: 0.5343 - val_loss: 1.1325 - val_acc: 0.5980
Epoch 10/10
103264/103287 [============================>.] - ETA: 1s - loss: 1.2840 - acc: 0.5373Epoch 00009: val_acc did not improve
103287/103287 [==============================] - 7025s - loss: 1.2841 - acc: 0.5373 - val_loss: 1.1280 - val_acc: 0.6013

Starting to Fine Tune Model

Epoch 1/50
103255/103287 [============================>.] - ETA: 2s - loss: 1.0101 - acc: 0.6478Epoch 00000: val_acc improved from -inf to 0.77851, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7957s - loss: 1.0101 - acc: 0.6478 - val_loss: 0.5961 - val_acc: 0.7785
Epoch 2/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.6161 - acc: 0.7673Epoch 00001: val_acc improved from 0.77851 to 0.81707, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7931s - loss: 0.6162 - acc: 0.7673 - val_loss: 0.4862 - val_acc: 0.8171
Epoch 3/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.5150 - acc: 0.8032Epoch 00002: val_acc did not improve
103287/103287 [==============================] - 7875s - loss: 0.5150 - acc: 0.8032 - val_loss: 0.5330 - val_acc: 0.8146
Epoch 4/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.4502 - acc: 0.8285Epoch 00003: val_acc improved from 0.81707 to 0.86761, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7950s - loss: 0.4501 - acc: 0.8286 - val_loss: 0.3782 - val_acc: 0.8676
Epoch 5/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.4040 - acc: 0.8461Epoch 00004: val_acc improved from 0.86761 to 0.88469, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7949s - loss: 0.4041 - acc: 0.8461 - val_loss: 0.3343 - val_acc: 0.8847
Epoch 6/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.3735 - acc: 0.8558Epoch 00005: val_acc improved from 0.88469 to 0.88887, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7951s - loss: 0.3734 - acc: 0.8558 - val_loss: 0.3043 - val_acc: 0.8889
Epoch 7/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.3466 - acc: 0.8671Epoch 00006: val_acc improved from 0.88887 to 0.90475, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7952s - loss: 0.3466 - acc: 0.8671 - val_loss: 0.2819 - val_acc: 0.9047
Epoch 8/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.3248 - acc: 0.8754Epoch 00007: val_acc improved from 0.90475 to 0.91603, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7952s - loss: 0.3248 - acc: 0.8754 - val_loss: 0.2481 - val_acc: 0.9160
Epoch 9/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.3069 - acc: 0.8822Epoch 00008: val_acc did not improve
103287/103287 [==============================] - 7953s - loss: 0.3069 - acc: 0.8822 - val_loss: 0.2435 - val_acc: 0.9151
Epoch 10/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.2903 - acc: 0.8881Epoch 00009: val_acc improved from 0.91603 to 0.91951, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7947s - loss: 0.2904 - acc: 0.8881 - val_loss: 0.2375 - val_acc: 0.9195
Epoch 11/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.2810 - acc: 0.8920Epoch 00010: val_acc improved from 0.91951 to 0.92685, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7915s - loss: 0.2811 - acc: 0.8920 - val_loss: 0.2124 - val_acc: 0.9269
Epoch 12/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.2667 - acc: 0.8980Epoch 00011: val_acc improved from 0.92685 to 0.92759, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7929s - loss: 0.2668 - acc: 0.8979 - val_loss: 0.2200 - val_acc: 0.9276
Epoch 13/50
103255/103287 [============================>.] - ETA: 2s - loss: 0.2576 - acc: 0.9016Epoch 00012: val_acc improved from 0.92759 to 0.92936, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 7952s - loss: 0.2576 - acc: 0.9016 - val_loss: 0.2115 - val_acc: 0.9294
Epoch 14/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2498 - acc: 0.9043Epoch 00013: val_acc improved from 0.92936 to 0.93350, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14073s - loss: 0.2498 - acc: 0.9042 - val_loss: 0.1939 - val_acc: 0.9335
Epoch 15/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2414 - acc: 0.9078Epoch 00014: val_acc improved from 0.93350 to 0.93562, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14422s - loss: 0.2414 - acc: 0.9078 - val_loss: 0.1982 - val_acc: 0.9356
Epoch 16/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2353 - acc: 0.9097Epoch 00015: val_acc did not improve
103287/103287 [==============================] - 14424s - loss: 0.2353 - acc: 0.9096 - val_loss: 0.1994 - val_acc: 0.9299
Epoch 17/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2289 - acc: 0.9116Epoch 00016: val_acc improved from 0.93562 to 0.93810, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14465s - loss: 0.2289 - acc: 0.9116 - val_loss: 0.1950 - val_acc: 0.9381
Epoch 18/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2242 - acc: 0.9127Epoch 00017: val_acc did not improve
103287/103287 [==============================] - 14454s - loss: 0.2242 - acc: 0.9127 - val_loss: 0.1990 - val_acc: 0.9370
Epoch 19/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2181 - acc: 0.9169Epoch 00018: val_acc improved from 0.93810 to 0.94428, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14361s - loss: 0.2182 - acc: 0.9168 - val_loss: 0.1772 - val_acc: 0.9443
Epoch 20/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2123 - acc: 0.9183Epoch 00019: val_acc did not improve
103287/103287 [==============================] - 14455s - loss: 0.2123 - acc: 0.9183 - val_loss: 0.1794 - val_acc: 0.9398
Epoch 21/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2070 - acc: 0.9213Epoch 00020: val_acc improved from 0.94428 to 0.94826, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14462s - loss: 0.2070 - acc: 0.9213 - val_loss: 0.1652 - val_acc: 0.9483
Epoch 22/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2038 - acc: 0.9223Epoch 00021: val_acc did not improve
103287/103287 [==============================] - 14476s - loss: 0.2038 - acc: 0.9223 - val_loss: 0.1660 - val_acc: 0.9450
Epoch 23/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.2022 - acc: 0.9232Epoch 00022: val_acc did not improve
103287/103287 [==============================] - 14493s - loss: 0.2022 - acc: 0.9232 - val_loss: 0.1656 - val_acc: 0.9465
Epoch 24/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1965 - acc: 0.9236Epoch 00023: val_acc did not improve
103287/103287 [==============================] - 14484s - loss: 0.1965 - acc: 0.9235 - val_loss: 0.1640 - val_acc: 0.9462
Epoch 25/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1920 - acc: 0.9268Epoch 00024: val_acc improved from 0.94826 to 0.95031, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14489s - loss: 0.1920 - acc: 0.9268 - val_loss: 0.1491 - val_acc: 0.9503
Epoch 26/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1879 - acc: 0.9272Epoch 00025: val_acc did not improve
103287/103287 [==============================] - 14484s - loss: 0.1880 - acc: 0.9272 - val_loss: 0.1648 - val_acc: 0.9444
Epoch 27/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1846 - acc: 0.9290Epoch 00026: val_acc did not improve
103287/103287 [==============================] - 14443s - loss: 0.1846 - acc: 0.9290 - val_loss: 0.1630 - val_acc: 0.9497
Epoch 28/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1845 - acc: 0.9287Epoch 00027: val_acc did not improve
103287/103287 [==============================] - 14508s - loss: 0.1845 - acc: 0.9287 - val_loss: 0.1534 - val_acc: 0.9500
Epoch 29/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1812 - acc: 0.9294Epoch 00028: val_acc improved from 0.95031 to 0.95332, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14614s - loss: 0.1811 - acc: 0.9294 - val_loss: 0.1453 - val_acc: 0.9533
Epoch 30/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1772 - acc: 0.9313Epoch 00029: val_acc did not improve
103287/103287 [==============================] - 14622s - loss: 0.1772 - acc: 0.9313 - val_loss: 0.1551 - val_acc: 0.9519
Epoch 31/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1760 - acc: 0.9323Epoch 00030: val_acc improved from 0.95332 to 0.95506, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14622s - loss: 0.1760 - acc: 0.9323 - val_loss: 0.1452 - val_acc: 0.9551
Epoch 32/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1735 - acc: 0.9325Epoch 00031: val_acc did not improve
103287/103287 [==============================] - 14608s - loss: 0.1735 - acc: 0.9325 - val_loss: 0.1408 - val_acc: 0.9549
Epoch 33/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1699 - acc: 0.9354Epoch 00032: val_acc improved from 0.95506 to 0.95653, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14638s - loss: 0.1699 - acc: 0.9354 - val_loss: 0.1388 - val_acc: 0.9565
Epoch 34/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1667 - acc: 0.9356Epoch 00033: val_acc did not improve
103287/103287 [==============================] - 14633s - loss: 0.1668 - acc: 0.9356 - val_loss: 0.1437 - val_acc: 0.9527
Epoch 35/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1680 - acc: 0.9355Epoch 00034: val_acc did not improve
103287/103287 [==============================] - 14643s - loss: 0.1679 - acc: 0.9355 - val_loss: 0.1474 - val_acc: 0.9548
Epoch 36/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1627 - acc: 0.9372Epoch 00035: val_acc improved from 0.95653 to 0.95661, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14643s - loss: 0.1626 - acc: 0.9372 - val_loss: 0.1450 - val_acc: 0.9566
Epoch 37/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1613 - acc: 0.9376Epoch 00036: val_acc did not improve
103287/103287 [==============================] - 14599s - loss: 0.1613 - acc: 0.9376 - val_loss: 0.1381 - val_acc: 0.9532
Epoch 38/50
100864/103287 [============================>.] - ETA: 282s - loss: 0.1583 - acc: 0.9393  
100896/103287 [============================>.] - ETA: 278s - loss: 0.1583 - acc: 0.9393
103255/103287 [============================>.] - ETA: 3s - loss: 0.1585 - acc: 0.9392Epoch 00037: val_acc did not improve
103287/103287 [==============================] - 14637s - loss: 0.1585 - acc: 0.9392 - val_loss: 0.1355 - val_acc: 0.9556
Epoch 39/50
  8512/103287 [=>............................] - ETA: 10983s - loss: 0.1586 - acc: 0.9401
103255/103287 [============================>.] - ETA: 3s - loss: 0.1586 - acc: 0.9395Epoch 00038: val_acc improved from 0.95661 to 0.95823, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14532s - loss: 0.1586 - acc: 0.9395 - val_loss: 0.1287 - val_acc: 0.9582
Epoch 40/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1567 - acc: 0.9394Epoch 00039: val_acc did not improve
103287/103287 [==============================] - 14648s - loss: 0.1566 - acc: 0.9394 - val_loss: 0.1493 - val_acc: 0.9543
Epoch 41/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1533 - acc: 0.9405Epoch 00040: val_acc improved from 0.95823 to 0.96059, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14664s - loss: 0.1534 - acc: 0.9405 - val_loss: 0.1217 - val_acc: 0.9606
Epoch 42/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1519 - acc: 0.9412Epoch 00041: val_acc did not improve
103287/103287 [==============================] - 14647s - loss: 0.1519 - acc: 0.9412 - val_loss: 0.1265 - val_acc: 0.9597
Epoch 43/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1490 - acc: 0.9430Epoch 00042: val_acc did not improve
103287/103287 [==============================] - 14609s - loss: 0.1490 - acc: 0.9430 - val_loss: 0.1392 - val_acc: 0.9587
Epoch 44/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1503 - acc: 0.9422Epoch 00043: val_acc did not improve
103287/103287 [==============================] - 14572s - loss: 0.1504 - acc: 0.9421 - val_loss: 0.1335 - val_acc: 0.9583
Epoch 45/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1484 - acc: 0.9430Epoch 00044: val_acc did not improve
103287/103287 [==============================] - 14607s - loss: 0.1485 - acc: 0.9430 - val_loss: 0.1317 - val_acc: 0.9593
Epoch 46/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1453 - acc: 0.9440Epoch 00045: val_acc did not improve
103287/103287 [==============================] - 14642s - loss: 0.1453 - acc: 0.9440 - val_loss: 0.1313 - val_acc: 0.9588
Epoch 47/50
103255/103287 [============================>.] - ETA: 3s - loss: 0.1450 - acc: 0.9446Epoch 00046: val_acc improved from 0.96059 to 0.96260, saving model to /Users/clinic1718/Desktop/FramesExecution/model/10Classifier/model_weights.h5
103287/103287 [==============================] - 14640s - loss: 0.1450 - acc: 0.9446 - val_loss: 0.1254 - val_acc: 0.9626